# AnalyticalGeometryIsValid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalGeometryIsValid Property
ParameterTypeId Class See Also
---
"Analytical Model Correct"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalGeometryIsValid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalGeometryIsValid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalGeometryIsValid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace